yunuskunduz-maker/ScoreBoard_Project/STM32_Scoreboard/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define A1_5_LDR_Pin GPIO_PIN_5
#define A1_5_LDR_GPIO_Port GPIOA
#define BUTON1_Pin GPIO_PIN_2
#define BUTON1_GPIO_Port GPIOB
#define BUTON1_EXTI_IRQn EXTI2_3_IRQn
#define BUTON2_Pin GPIO_PIN_10
#define BUTON2_GPIO_Port GPIOB
#define BUTON2_EXTI_IRQn EXTI4_15_IRQn
#define BUTON3_Pin GPIO_PIN_11
#define BUTON3_GPIO_Port GPIOB
#define BUTON3_EXTI_IRQn EXTI4_15_IRQn
#define BUZZER_Pin GPIO_PIN_12
#define BUZZER_GPIO_Port GPIOB
#define LED_5_Pin GPIO_PIN_15
#define LED_5_GPIO_Port GPIOA
#define LED_WHITE_Pin GPIO_PIN_0
#define LED_WHITE_GPIO_Port GPIOD
#define LED_BLUE_Pin GPIO_PIN_1
#define LED_BLUE_GPIO_Port GPIOD
#define LED_GREEN_Pin GPIO_PIN_2
#define LED_GREEN_GPIO_Port GPIOD
#define LED_RED_Pin GPIO_PIN_3
#define LED_RED_GPIO_Port GPIOD
#define RGB_B_Pin GPIO_PIN_3
#define RGB_B_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
